## Production: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 2 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_scheduled_action.api-5pm must be replaced
-/+ resource "aws_appautoscaling_scheduled_action" "api-5pm" {
      ~ arn                = "arn:aws:autoscaling:ca-central-1:296255494825:scheduledAction:d57912f0-f028-45f3-8f81-8315be9231cf:resource/lambda/function:api-lambda:7:scheduledActionName/api-5pm" -> (known after apply)
      ~ id                 = "api-5pm-lambda-function:api-lambda:7" -> (known after apply)
        name               = "api-5pm"
      ~ resource_id        = "function:api-lambda:7" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_scheduled_action.api-noon must be replaced
-/+ resource "aws_appautoscaling_scheduled_action" "api-noon" {
      ~ arn                = "arn:aws:autoscaling:ca-central-1:296255494825:scheduledAction:d57912f0-f028-45f3-8f81-8315be9231cf:resource/lambda/function:api-lambda:7:scheduledActionName/api-noon" -> (known after apply)
      ~ id                 = "api-noon-lambda-function:api-lambda:7" -> (known after apply)
        name               = "api-noon"
      ~ resource_id        = "function:api-lambda:7" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_target.api must be replaced
-/+ resource "aws_appautoscaling_target" "api" {
      ~ id                 = "function:api-lambda:7" -> (known after apply)
      ~ max_capacity       = 5 -> 10
      ~ resource_id        = "function:api-lambda:7" -> (known after apply) # forces replacement
      ~ role_arn           = "arn:aws:iam::296255494825:role/aws-service-role/lambda.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_LambdaConcurrency" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id        = "arn:aws:iam::296255494825:policy/notify-api"
        name      = "notify-api"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (3 unchanged elements hidden)
                    {
                        Action   = [
                            "sqs:*",
                            "sns:Publish",
                            "securityhub:BatchImportFindings",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                  + {
                      + Action   = "ssm:DescribeParameters"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "ssm:GetParameters"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ca-central-1:296255494825:parameter/ENVIRONMENT_VARIABLES"
                      + Sid      = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api-lambda"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:api-lambda:7" -> (known after apply)
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "MLWR_HOST"                             = (sensitive)
              + "NEW_RELIC_ACCOUNT_ID"                  = "2691974"
              + "NEW_RELIC_EXTENSION_LOGS_ENABLED"      = "true"
              + "NEW_RELIC_LAMBDA_EXTENSION_ENABLED"    = "true"
              + "NEW_RELIC_LAMBDA_HANDLER"              = "application.handler"
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "SQLALCHEMY_DATABASE_READER_URI"        = (sensitive)
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "SQLALCHEMY_DATABASE_URI"               = (sensitive)
                # (26 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_provisioned_concurrency_config.api must be replaced
-/+ resource "aws_lambda_provisioned_concurrency_config" "api" {
      ~ id                                = "api-lambda:7" -> (known after apply)
      ~ qualifier                         = "7" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.ecr-user-access-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

33 tests, 16 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
